local _pack = {

    --技能模板(通魔)
    -- 1Q 2W 3E 4R
    template = {
        [1] = "A00N",
        [2] = "A000",
        [3] = "A00V",
        [4] = "A00P",
    },

    --技能模板治疗(通魔)
    -- 1Q 2W 3E 4R
    template_reverse = {
        [1] = "A00Q",
        [2] = "A00T",
        [3] = "A00R",
        [4] = "A00S",
    },

    orb = {
        name = {
            [1 ]="火球",
            [2 ]="冰球",
            [3 ]="毒球",
            [4 ]="腐蚀",
            [5 ]="电球",
            [6 ]="流血",
            [7 ]="重击",
            [8 ]="恐惧",
            [9 ]="缓慢",
            [10]="吸血",
            [11]="吸蓝",
            [12]="烧蓝",
            [13]="反馈",
        },
        buff={
            [1 ]="",
            [2 ]="",
            [3 ]="",
            [4 ]="",
            [5 ]="",
            [6 ]="",
            [7 ]="",
            [8 ]="",
            [9 ]="",
            [10]="",
            [11]="",
            [12]="",
            [13]="",
        },
        --初始几率
        pr = {
            [1 ]=1,
            [2 ]=1,
            [3 ]=1,
            [4 ]=1,
            [5 ]=1,
            [6 ]=1,
            [7 ]=1,
            [8 ]=1,
            [9 ]=1,
            [10]=1,
            [11]=1,
            [12]=1,
            [13]=1,


        },
        --初始伤害
        -- 大于2表示固定伤害 小于等于1表示与攻击力挂钩
        dmg={
            [1 ]=2,
            [2 ]=2,
            [3 ]=2,
            [4 ]=2,
            [5 ]=2,
            [6 ]=2,
            [7 ]=2,
            [8 ]=2,
            [9 ]=2,
            [10]=2,
            [11]=2,
            [12]=2,
            [13]=2,

        }

    },

    --[[ cd组： 药水20秒  药剂0  大药剂300秒  礼包类 使用独立的技能]]
    consumeType = {
        [1 ] = "恢复生命立即",  --恢复x点   药水     
        [2 ] = "恢复魔法立即",  --恢复x点   药水
        [3 ] = "恢复生命缓慢",  --20秒内恢复x点   药水
        [4 ] = "恢复魔法缓慢",  --20秒内恢复x点   药水
        [5 ] = "提升攻击力",       --提升x% 持续5分钟  药剂
        [6 ] = "提升防御",        --提升x% 持续5分钟  药剂
        [7 ] = "提升速度",        --提升x% 持续5分钟  药剂
        [8 ] = "提升物理暴击率",   --提升x% 持续5分钟  药剂
        [9 ] = "提升物理暴击伤害", --提升x% 持续5分钟  药剂
        [10] = "提升魔法暴击率",   --提升x% 持续5分钟  药剂
        [11] = "提升魔法暴击伤害", --提升x% 持续5分钟  药剂
        [12] = "立刻冷却",
        [13] = "隐身",  --持续10秒     大药剂
        [14] = "回城",                --药剂
        [15] = "无敌",  --持续10秒     大药剂
        [16] = "幻化",  --持续15分钟   大药剂
        [17] = "魔免",  --持续20秒     大药剂
        [18] = "虚无",  --持续20秒     大药剂
        [19] = "复活",  --5分钟内死亡复活 恢复x%状态  大药剂
    }
}


return _pack
