local _pack = {

    BASE_TYPE = {
        EQUIP         = 10, --装备 
        EQUIP_USABLE  = 20, --装备 (有主动技能)
        CONSUM        = 30, --消耗品
        MATERR        = 40, --材料 
        INGEM         = 50, --镶嵌宝石
    },


    EX_TYPE = {
        W_SWORD  = 11,--大剑  
        W_MITTS  = 12,--拳套
        w_DAGGER = 13,--短剑  刺客双剑
        W_MUSKET = 14,--火枪
        W_GUN    = 15,--手枪
        W_ARCH   = 16,--弓箭
        W_STAFF  = 17,--法杖
        W_MBOOK  = 18,--魔法书
        W_SINGLE = 19,--单手剑 坦克剑

        E_CHEST      = 20, --胸甲
        E_PHY_SHIELD = 21, --物理型盾牌
        E_MGC_SHIELD = 22, --魔法型盾牌
        E_TRINKET    = 23, --饰品
        E_WING       = 24, --翅膀
        E_TITLE      = 25, --称号
        E_SCTN       = 26, --散件

        C_LMDC = 31, --药水
        C_DOSE = 32, --药剂
        C_DAY  = 33, --每日
        C_WEEK = 34, --每周
        C_ONE  = 35, --每局

        M_1    = 41,--洗练
        M_2    = 42,--强化

        IG_1   = 51,-- 物理暴击宝石
        IG_2   = 52,-- 物暴伤害宝石
        IG_3   = 53,-- 魔法暴击宝石
        IG_4   = 54,-- 魔暴伤害宝石
        --...
    },

    BASE_TYPE_NAME = {
        [10] = "装备",
        [20] = "装备",
        [30] = "消耗品",
        [40] = "材料",
        [50] = "镶嵌宝石",
    },

    EX_TYPE_NAME = {
        [11] = "大剑",   --10+1
        [12] = "拳套",   --10+2
        [13] = "短剑",   --10+3
        [14] = "火枪",   --10+4
        [15] = "手枪",   --10+5
        [16] = "弓箭",   --10+6
        [17] = "法杖",   --10+7
        [18] = "魔法书", --10+8
        [19] = "单手剑", --10+9

        [20] = "胸甲",   --10+10
        [21] = "盾牌",   --10+11 物理盾牌
        [22] = "盾牌",   --20+2  魔法盾牌
        [23] = "饰品",   --20+3
        [24] = "翅膀",   --20+4
        [25] = "称号",   --10+15
        [26] = "散件",   --10+16

        [31] = "恢复药水",--30+1
        [32] = "强化药剂",--30+2
        [33] = "每日礼包",--30+3 
        [34] = "每周礼包",--30+4
        [35] = "每局礼包",--30+5
    },

    EX_WEAP_DT = {
        [11] = "普通",
        [12] = "普通",
        [13] = "普通",
        [14] = "穿刺",
        [15] = "穿刺",
        [16] = "穿刺",
        [17] = "魔法",
        [18] = "魔法",
        [19] = "普通",
    },

    EX_ARMOR_DT={
        [0] = "布甲",
        [1] = "轻甲",
        [2] = "重甲",
    },

    EX_GAMER_DEFTYPE={
        none   = "未知", --无
        normal = "未知", --普通
        small  = "布甲", --小型 **
        medium = "轻甲", --中型 **
        large  = "重甲", --大型 **
        fort   = "未知", --城墙
    },

    --装备item_bind_p1.type
    --镶嵌item_bind.type
    PARAMS = {
        [0 ] = "攻击强度", 
        [1 ] = "攻击速度",
        [2 ] = "法术强度",
        [3 ] = "冷却时间",
        [4 ] = "暴击几率",
        [5 ] = "暴击伤害",
        [6 ] = "生命上限",
        [7 ] = "生命回复",
        [8 ] = "魔法上限",
        [9 ] = "魔法回复",
        [10] = "物理防御",
        [11] = "魔法防御",
        [12] = "移动速度",

        [20] = "攻击强度", 
        [21] = "攻击速度",
        [22] = "法术强度",
        [23] = "冷却时间",
        [24] = "暴击几率",
        [25] = "暴击伤害",
        [26] = "生命上限",
        [27] = "生命回复",
        [28] = "魔法上限",
        [29] = "魔法回复",
        [30] = "物理防御",
        [31] = "魔法防御",
        [32] = "移动速度",
        
        -- 唯一特效 天赋法球
        [60] = "火焰",      --buff dot
        [61] = "冰霜",      --buff 25%减速 几率冻结
        [62] = "腐蚀",      --buff 降低护甲15%
        [63] = "诅咒",      --buff 降低魔防15%
        [64] = "恐惧",      --buff 降低攻击25%
        [65] = "缓慢",      --buff 75%减速
        [66] = "闪电",      --buff 易伤15% 几率定身
        [67] = "灼热",      --buff 增加伤害20%
        [68] = "魔法回应",  --烧蓝
        [69] = "毒药",      --buff dot
        [70] = "沉默",      --5%几率 沉默5秒
        [71] = "粉碎",      --对非英雄单位增加35%伤害

        [72] = "净化",      --25%几率 定身5秒缓慢恢复移动速度 对召唤单位造成400%伤害
        [73] = "飓风",      --25%几率 吹风并沉默5秒
        [74] = "幻象",      --5%几率 复制一个目标的镜像持续25秒，最多存在2个

        [75] = "通用", --无视魔法免疫和虚无，不受护甲和魔防减伤
        [76] = "闪避", --单手剑限定
        [77] = "分裂", --近战
        [78] = "重击", --近战  25%几率 增加80%伤害+眩晕2秒 
        [79] = "多重箭",--远程 攻击多个目标
        [80] = "穿透",  --远程 攻击一条线目标
        [81] = "溅射",  --远程 攻击后扩散
        [82] = "弹射",  --远程 攻击后弹射


        --附加技能 主动装备
        [90] = "",
    },
}

return _pack
